In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [13]:
df_brands = pd.read_csv('Rt8ETleD0l2G_one')
df_led_disb = pd.read_csv('led_disbursements.csv')

In [14]:
df_led_brand =df_brands[df_brands['CATEGORY_DESC'] == 'LED']

In [15]:
joined = df_led_disb.merge(df_led_brand,left_on='MODEL_ID',right_on='MODEL_ID',how='inner')

In [17]:
del joined['MD5_VALUE']

In [18]:
joined = joined.dropna()

In [7]:
state_data = pd.read_csv('Season_BFL_LED - Sheet14.csv')

In [8]:
state_data.columns

Index(['city', 'SUM of count', 'State', 'Unnamed: 3', 'Unnamed: 4'], dtype='object')

In [9]:
del state_data['Unnamed: 3']
del state_data['Unnamed: 4']
del state_data['SUM of count']

In [10]:
state_data.head()

          city State
0  Grand Total   NaN
1    HYDERABAD    AP
2    BANGALORE    KA
3       MUMBAI    MH
4      CHENNAI    TN

In [ ]:
state_data = pd.merge(df_clean, state_data, on='city')

In [19]:
joined.shape

(1333563, 42)

In [20]:
joined.isna().sum()

Unnamed: 0_x                   0
CUSTOMER_ID                    0
AGREEMENT_NO                   0
DISBURSEMENT_DATE              0
PRODUCT_ID                     0
MODEL_ID                       0
AMT_FIN                        0
EMI                            0
AGE                            0
EMPLOYMENTTYPE                 0
GENDER                         0
MARITALSTATUS                  0
CITY                           0
Unnamed: 0_y                   0
MODEL_KEY                      0
MODEL_NO                       0
CATEGORY_ID                    0
CATEGORY_DESC                  0
CATEGORY_STATUS                0
MAKE                           0
MAKE_MODEL_FLAG                0
MANUFACTURER_WARRANTY_YRS      0
MANUFACTURER_ID                0
MANUFACTURER_NAME              0
MODEL_EXPIRY_DATE              0
SELLING_PRICE                  0
SIZE                           0
MODEL_STATUS                   0
EXTENDED_WARRANTY_FLAG         0
UNIT                           0
CATEGORY_DESC_FOR_INSURANCE    0
CIBIL_CHECK                    0
RISK_CLASS                     0
REMI_CATG                      0
BUSINESS_DATE                  0
AUTHOR_DATE                    0
INZ                            0
OUTZ                           0
MODIFIED_DATE                  0
MODIFIED_TIME                  0
HASHBYTESSHA1                  0
EXACT_MODEL_DESC               0
dtype: int64

In [22]:
df_clean = pd.DataFrame()
df_clean[['customer_id','age','etype','gender', 'maritalstatus', 'city','manu_name','dis_data']] = joined[['CUSTOMER_ID','AGE','EMPLOYMENTTYPE','GENDER', 'MARITALSTATUS', 'CITY','MANUFACTURER_NAME','DISBURSEMENT_DATE']]

In [23]:
df_clean.head()

   customer_id   age          etype  gender maritalstatus        city                     manu_name  dis_data
1     65592179  43.0  SELF EMPLOYED    Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181130
3     20686212  30.0  SELF EMPLOYED    Male     UNMARRIED   JALANDHAR  LG ELECTRONICS INDIA PVT.LTD  20180925
4     21550688  50.0  SELF EMPLOYED    Male       MARRIED      NAGPUR  LG ELECTRONICS INDIA PVT.LTD  20181129
5     18152487  57.0       SALARIED  Female       MARRIED    KOTTAYAM  LG ELECTRONICS INDIA PVT.LTD  20181208
6     52374870  38.0  SELF EMPLOYED    Male       MARRIED      SANGLI  LG ELECTRONICS INDIA PVT.LTD  20181231

In [24]:
df = pd.merge(df_clean, state_data, on='city')

In [25]:
df.head()

   customer_id   age          etype gender maritalstatus        city                     manu_name  dis_data State
0     65592179  43.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181130    TN
1     40986359  36.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181211    TN
2     52417053  41.0       SALARIED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20180929    TN
3     40907074  47.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181031    TN
4     50100344  37.0       SALARIED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181116    TN

In [26]:
df.shape

(1333563, 9)

In [27]:
df = df[df['State'].notnull()]

In [28]:
df.shape

(995237, 9)

In [31]:
# Binnig age
g = []
for elem in range(100):
    if elem % 5 == 0:
        #print(elem)
        g.append(elem)
df['AgeRange'] = pd.cut(df['age'], g)

In [32]:
df.head()

   customer_id   age          etype gender maritalstatus        city                     manu_name  dis_data State  AgeRange
0     65592179  43.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181130    TN  (40, 45]
1     40986359  36.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181211    TN  (35, 40]
2     52417053  41.0       SALARIED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20180929    TN  (40, 45]
3     40907074  47.0  SELF EMPLOYED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181031    TN  (45, 50]
4     50100344  37.0       SALARIED   Male       MARRIED  COIMBATORE  LG ELECTRONICS INDIA PVT.LTD  20181116    TN  (35, 40]

In [34]:
from tqdm import tqdm
temp = ''
a = []
for i,row in tqdm(df.iterrows(),total=df.shape[0]):
    temp = str(row['AgeRange'])
    temp = temp.replace('(','')
    temp = temp.split(',')
    a.append(temp[0])
df['age_bin'] = a

100%|██████████| 995237/995237 [02:11<00:00, 7582.44it/s]

In [37]:
df['etype'] = df['etype'].replace({'SELF EMPLOYED': 'self_employed', 'Self Employed': 'self_employed', 'SELF EMPLOYED PROFESSIONAL': 'self_employed','Self Employed Professional':'self_employed'})

In [35]:
df['etype'] = df['etype'].replace({'SALARIED': 'salaried', 'Salaried': 'salaried', 'SAL': 'salaried'})

In [38]:
df.etype.value_counts()

self_employed      860613
salaried           134401
Not Categorized       206
OTHERS                 17
Name: etype, dtype: int64

In [39]:
df.maritalstatus.value_counts()

MARRIED      876667
UNMARRIED    118376
DIVORCEE        167
WIDOW            27
Name: maritalstatus, dtype: int64

In [40]:
a = []
b = []
c = []
temp = ''
t = ''
s = ''
v = ''
from tqdm import tqdm
for i,row in tqdm(df.iterrows(),total = df.shape[0]):
    temp = row['dis_data']
    t = str(temp)[:6]
    s = str(temp)[:4]
    v = str(temp)[4:6]
    a.append(t)
    b.append(s)
    c.append(v)

100%|██████████| 995237/995237 [01:59<00:00, 8323.49it/s]

In [41]:
df['yyyymm'] = a
df['yyyy'] = b
df['mm'] = c

In [42]:
df = df.dropna()

In [45]:
temp = ''
a = []
for i,row in tqdm(df.iterrows(),total=df.shape[0]):
    temp = str(row['AgeRange'])
    temp = temp.replace('(','')
    temp = temp.split(',')
    a.append(temp[0])
df['age_bin'] = a

100%|██████████| 995237/995237 [02:22<00:00, 7006.86it/s]

In [49]:
del df['customer_id']
del df['city']
del df['dis_data']
del df['AgeRange']

In [50]:
df.head()

    age          etype gender maritalstatus                     manu_name State age_bin  yyyymm  yyyy  mm
0  43.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      40  201811  2018  11
1  36.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      35  201812  2018  12
2  41.0       salaried   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      40  201809  2018  09
3  47.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      45  201810  2018  10
4  37.0       salaried   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      35  201811  2018  11

In [59]:
df1 = df.manu_name.value_counts().to_frame().reset_index()

In [60]:
df1.columns = ['brand','count']

In [65]:
top_7 = df1.iloc[:7].brand.tolist()

In [78]:
df= df.drop(df[(df['manu_name'] != top_7[0]) & (df['manu_name'] != top_7[1]) & (df['manu_name'] != top_7[2]) & (df['manu_name'] != top_7[3]) & (df['manu_name'] != top_7[4]) & (df['manu_name'] != top_7[5]) & (df['manu_name'] != top_7[6])].index)

In [79]:
df.head()

    age          etype gender maritalstatus                     manu_name State age_bin  yyyymm  yyyy  mm
0  43.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      40  201811  2018  11
1  36.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      35  201812  2018  12
2  41.0       salaried   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      40  201809  2018  09
3  47.0  self_employed   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      45  201810  2018  10
4  37.0       salaried   Male       MARRIED  LG ELECTRONICS INDIA PVT.LTD    TN      35  201811  2018  11

In [80]:
df.manu_name.value_counts()

SONY INDIA LIMITED                            258420
LG ELECTRONICS INDIA PVT.LTD                  231898
SAMSUNG ELECTRONICS INDIA LIMITED             213826
PANASONIC INDIA LIMITED                       109863
LLOYD ELECTRIC & ENGINEERING LIMITED(LEEL)     30725
HAIER APPLIANCES (INDIA) P.LIMITED             29433
INTEX                                          18484
Name: manu_name, dtype: int64

In [72]:
from sklearn import preprocessing

In [73]:
le = preprocessing.LabelEncoder()

In [81]:
le.fit(df.manu_name.unique())

LabelEncoder()

In [82]:
le.classes_

array(['HAIER APPLIANCES (INDIA) P.LIMITED', 'INTEX',
       'LG ELECTRONICS INDIA PVT.LTD',
       'LLOYD ELECTRIC & ENGINEERING LIMITED(LEEL)',
       'PANASONIC INDIA LIMITED', 'SAMSUNG ELECTRONICS INDIA LIMITED',
       'SONY INDIA LIMITED'], dtype=object)

In [88]:
df['label'] = le.transform(df.manu_name)

In [90]:
df.label.value_counts()

6    258420
2    231898
5    213826
4    109863
3     30725
0     29433
1     18484
Name: label, dtype: int64

In [92]:
df.head()

    age          etype gender maritalstatus State age_bin  yyyymm  yyyy  mm  label
0  43.0  self_employed   Male       MARRIED    TN      40  201811  2018  11      2
1  36.0  self_employed   Male       MARRIED    TN      35  201812  2018  12      2
2  41.0       salaried   Male       MARRIED    TN      40  201809  2018  09      2
3  47.0  self_employed   Male       MARRIED    TN      45  201810  2018  10      2
4  37.0       salaried   Male       MARRIED    TN      35  201811  2018  11      2

In [91]:
del df['manu_name']

# Preprocessing done, Model wrangling starts

In [101]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [95]:
one_hot = pd.get_dummies(df['etype'])
df = df.drop('etype',axis = 1)
df = df.join(one_hot)

one_hot = pd.get_dummies(df['gender'])
df = df.drop('gender',axis = 1)
df = df.join(one_hot)

one_hot = pd.get_dummies(df['maritalstatus'])
df = df.drop('maritalstatus',axis = 1)
df = df.join(one_hot)

one_hot = pd.get_dummies(df['State'])
df = df.drop('State',axis = 1)
df = df.join(one_hot)

In [96]:
df.head()

    age age_bin  yyyymm  yyyy  mm  label  Not Categorized  OTHERS  salaried  self_employed  Female  Male  DIVORCEE  MARRIED  UNMARRIED  WIDOW  AP  BH  BR  DELHI  GJ  HR  KA  KE  MH  MP  OR  PU  RJ  TN  UK  UP  WB
0  43.0      40  201811  2018  11      2                0       0         0              1       0     1         0        1          0      0   0   0   0      0   0   0   0   0   0   0   0   0   0   1   0   0   0
1  36.0      35  201812  2018  12      2                0       0         0              1       0     1         0        1          0      0   0   0   0      0   0   0   0   0   0   0   0   0   0   1   0   0   0
2  41.0      40  201809  2018  09      2                0       0         1              0       0     1         0        1          0      0   0   0   0      0   0   0   0   0   0   0   0   0   0   1   0   0   0
3  47.0      45  201810  2018  10      2                0       0         0              1       0     1         0        1          0      0   0   0   0      0   0   0   0   0   0   0   0   0   0   1   0   0   0
4  37.0      35  201811  2018  11      2                0       0         1              0       0     1         0        1          0      0   0   0   0      0   0   0   0   0   0   0   0   0   0   1   0   0   0

In [97]:
df.shape

(892649, 33)

In [107]:
df.dtypes

age                float64
age_bin             object
yyyymm              object
yyyy                object
mm                  object
Not Categorized      uint8
OTHERS               uint8
salaried             uint8
self_employed        uint8
Female               uint8
Male                 uint8
DIVORCEE             uint8
MARRIED              uint8
UNMARRIED            uint8
WIDOW                uint8
AP                   uint8
BH                   uint8
BR                   uint8
DELHI                uint8
GJ                   uint8
HR                   uint8
KA                   uint8
KE                   uint8
MH                   uint8
MP                   uint8
OR                   uint8
PU                   uint8
RJ                   uint8
TN                   uint8
UK                   uint8
UP                   uint8
WB                   uint8
dtype: object

In [98]:
y = df.label.tolist()
del df['label']
X = df.copy()

In [109]:
X = X.values
y = y

AttributeError: 'numpy.ndarray' object has no attribute 'values'

In [99]:
len(X),len(y)

(892649, 892649)

In [110]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [111]:
import xgboost as xgb

In [112]:
model = xgb.XGBClassifier(n_jobs=-1)

In [113]:
model.fit(X_train,y_train)

KeyboardInterrupt:

In [ ]:
y_pred = model.predict(X_test.values)

In [ ]:
accuracy_score(y_test, y_pred)

In [ ]:
feat_importances = pd.Series(clf.feature_importances_)
%matplotlib inline

In [ ]:
feat_importances.nlargest(len(feat_importances)).plot(kind='barh')

In [ ]:
import pickle
with open('R20.7.model','wb') as f:
    pickle.dump(model,f)
with open('R20.7.le','wb') as f:
    pickle.dump(le,f)